ErichStyger/mcuoneclipse/Examples/KDS/TWR-KV58F220M/TWR_KV58F220M_PEx_2_SDKv2/SDK/platform/system/src/clock/MKV58F24/fsl_clock_MKV58F24.c
    src = CLOCK_HAL_GetTimeSrc(SIM, instance);

    switch(src)
    {
        case kClockTimeSrcCoreSysClk: /* Core/System clock. */
            freq = CLOCK_SYS_GetCoreClockFreq();
            break;
        case kClockTimeSrcPllFllSel:  /* FLL/PLL/IRC48M. */
            freq = CLOCK_SYS_GetPllFllClockFreq();
            break;
        case kClockTimeSrcOsc0erClk:   /* OSCERCLK. */
            freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
            break;
        case kClockTimeSrcExt:        /* ENET 1588 clock in. */
            freq = g_enet1588ClkInFreq[0];
            break;
        default:
            freq = 0U;
            break;
    }
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetGpioFreq
 * Description   : Gets the clock frequency for GPIO module. 
 * This function gets the clock frequency for GPIO module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetGpioFreq(uint32_t instance)
{
    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kSystemClock, &freq);
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEncFreq
 * Description   : Gets the clock frequency for ENC module. 
 * This function gets the clock frequency for ENC module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetEncFreq(uint32_t instance)
{
    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kFastPeripheralClock, &freq);
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetWdogFreq
 * Description   : Gets watch dog clock frequency.
 * This function gets the watch dog clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetWdogFreq(uint32_t instance, clock_wdog_src_t wdogSrc)
{
    if (kClockWdogSrcLpoClk == wdogSrc)
    {
        return CLOCK_SYS_GetLpoClockFreq();
    }
    else
    {
        return CLOCK_SYS_GetBusClockFreq();
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetXbarFreq
 * Description   : Gets the clock frequency for XBAR module. 
 * This function gets the clock frequency for XBAR module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetXbarFreq(uint32_t instance)
{
    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kBusClock, &freq);
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetAoiFreq
 * Description   : Gets the clock frequency for AOI module. 
 * This function gets the clock frequency for AOI module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetAoiFreq(uint32_t instance)
{
    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kBusClock, &freq);
    return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlexcanFreq
 * Description   : Gets FLEXCAN clock frequency.
 * This function gets the FLEXCAN clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlexcanFreq(uint8_t instance, clock_flexcan_src_t flexcanSrc)
{
    uint32_t freq = 0;
    if (kClockFlexcanSrcOsc0erClk == flexcanSrc)
    {
        return CLOCK_SYS_GetOsc0ExternalRefClockFreq();
    }
    else
    { 
        CLOCK_SYS_GetFreq(kFastPeripheralClock, &freq);
        return freq;
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
